# GetColorEncoding Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointCloudAccess..::..GetColorEncoding Method
IPointCloudAccess Interface See Also
---
Returns the encoding used by points in this point cloud.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
PointCloudColorEncoding GetColorEncoding()
```

Visual Basic
---
```text
Function GetColorEncoding As PointCloudColorEncoding
```

Visual C++
---
```text
PointCloudColorEncoding GetColorEncoding()
```

# ### Return Value
The encoding.
# See Also
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace